// Ch10 kb1.v
// 鍵盤掃描輸入

module kb1 (Clk, Clr, C, R, N);
input  Clk, Clr;	// 一位元輸入
input  [1:3]  C;	// 三位元輸入
output [4:1]  R;	// 四位元輸出
output [3:0]  N;	// 四位元輸出
reg    [4:1]  R;	// 宣告為暫存器資料
reg    [3:0]  N;	// 宣告為暫存器資料

// 產生行掃描信號 R, 循環移位
always@ (posedge Clk)
  begin
    if (Clr)
      R = 4'b1110;			// R 初值 (只能有一個0)
    else
      R = {R[3:1],R[4]};		// 循環移位

// 比對行列資料, 按鍵結果存入 N
    case ({R,C})
      7'b1110011  : N = 4'b0001;  	// 1
      7'b1110101  : N = 4'b0010;  	// 2
      7'b1110110  : N = 4'b0011;  	// 3
      7'b1101011  : N = 4'b0100;  	// 4
      7'b1101101  : N = 4'b0101;  	// 5
      7'b1101110  : N = 4'b0110;  	// 6
      7'b1011011  : N = 4'b0111;  	// 7
      7'b1011101  : N = 4'b1000; 	// 8
      7'b1011110  : N = 4'b1001;  	// 9
      7'b0111011  : N = 4'b1010;  	// *
      7'b0111101  : N = 4'b0000;  	// 0
      7'b0111110  : N = 4'b1011;  	// #
      default     : N = N;        	// 維持原狀
    endcase
  end

endmodule
